---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchingInWrongView
source: html/ed97eeb9-c88a-e852-8d97-e3140c47d212.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchingInWrongView Property

Detail sketch is not editable in this view.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchingInWrongView { get; }
```